Revit 2015 API
FormatOptions.GetRounding Method
 Gets the accuracy to which values will be rounded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use the Accuracy property instead.")]
public double GetRounding()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use the Accuracy property instead.")> _
Public Function GetRounding As Double
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use the Accuracy property instead.")]
public:
double GetRounding()
Return Value
 The accuracy.
Remarks
 This method returns the value of the Accuracy property. See that property for details.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace